{
  "actions": {
    "explore-now": "EXPLORE NOW",
    "enquire-more": "Enquire more",
    "read-more": "Read more",
    "recommendation": "Recommendation",
    "certificate": "Certificate",
    "send-message": "SEND MESSAGE",
    "contact-me": "CONTACT ME",
    "view-on-google-map": "View on Google Map"
  },
  "profile": {
    "name": "Avishek Dangol",
    "position": "Machine Learning Engineer {'|'} Full Stack Web Developer",
    "country": "United Kingdom",
    "city": "London",
    "download-cv": "Download CV"
  },
  "labels": {
    "residence": "Residence:",
    "city": "City:",
    "country": "Country:",
    "description": "Description",
    "project-details": "Project Details",
    "status": "Status:",
    "client": "Client:",
    "location": "Location:",
    "associated-networks": "Associated Networks",
    "features": "Features",
    "skills-and-deliverables": "Skills and Deliverables"
  },
  "languages": {
    "nepali": "Nepali",
    "english": "English",
    "hindi": "Hindi"
  },
  "skills": {
    "ml": {
      "title": "Machine Learning",
      "data-exploration": "Data Exploration",
      "deep-learning": "Deep Learning",
      "computer-vision": "Computer Vision",
      "natural-language-processing": "Natural Language Processing",
      "explainable-ai": "Explainable AI"
    },
    "laravel": {
      "title": "Laravel",
      "multi-tenancy": "Multi-Tenancy",
      "websockets": "Web Sockets",
      "rest-api": "REST API",
      "testing": "Testing"
    },
    "vue": {
      "title": "Vue JS",
      "vue-cli": "Vue CLI",
      "vuex": "State Management with Vuex",
      "pinia": "State Management with Pinia"
    },
    "react": {
      "title": "React JS",
      "context-api": "Context API",
      "hoc": "Higher Order Components",
      "state-management": "State Management with Redux"
    },
    "node": {
      "title": "Node JS",
      "express": "Express JS",
      "rest-api": "REST API",
      "middlewares": "Middlewares",
      "websockets": "Web Sockets"
    }
  },
  "knowledge": {
    "ml": "PyTorch, Tensorflow, Scikit-Learn",
    "shadcn-ant": "Shadcn, Ant Design, Material UI",
    "sql": "MYSQL, PostgreSQL, MongoDB",
    "css": "Bootstrap CSS, Tailwind CSS",
    "git": "Git, GitHub, GitLab, BitBucket"
  },
  "counter": {
    "years-experience": "Years Experience",
    "previous-commissions": "Previous Commissions",
    "happy-customers": "Happy Customers"
  },
  "home": {
    "banner": {
      "title": "Join me in this Amazing Journey!",
      "i": "I",
      "develop-models": "develop machine learning models.",
      "develop-websites": "develop websites.",
      "design-graphics": "design graphics."
    },
    "services": {
      "title": "My Services",
      "web-apps": {
        "title": "Web Development",
        "description": {
          "0": "Websites and Web Apps are transforming how businesses connect with their customers. In today's digital age, an online presence is essential.",
          "1": "Whether you run a retail shop, medical clinic, restaurant, or provide services, I can create a captivating website that attracts and engages more customers than ever."
        }
      },
      "machine-learning": {
        "title": "Machine Learning",
        "description": {
          "0": "AI and machine learning are revolutionising industries by automating tasks, enhancing decision-making, and providing personalized experiences.",
          "1": "From predictive analytics and computer vision to natural language processing, I can help you harness the power of AI to drive innovation and efficiency in your business."
        }
      }
    },
    "networks": {
      "title": "My Networks",
      "sd": {
        "name": "Sanjok Dangol",
        "job": "Laravel Developer"
      },
      "sm": {
        "name": "Sujip Maharjan",
        "job": "Backend Developer"
      },
      "kk": {
        "name": "Kumud Khatiwada",
        "job": "MERN Stack Developer"
      },
      "pp": {
        "name": "Pawan Pulami",
        "job": "Django Developer"
      }
    },
    "recommendations": {
      "title": "Recommendations",
      "jeff": {
        "name": "Jeff Rogers",
        "position": "CEO / CTO",
        "company": "Global English Campus",
        "address": "South Korea",
        "description": {
          "0": "I am very pleased to speak positively about the experience we have had with Avishek during the entire tenure of his time with us.",
          "1": "Two of the main strengths that Avishek has is his positive attitude and his superior communication skills, which are critical in development when abstract and sometimes unclear concepts are being converted to code. Avishek always clarifies through inquiry, by which process all members of the team benefit, as does the project as a whole.",
          "2": "Another quality that we value highly in Avishek, is his ability to work on a diverse team, and to not only do his part, but to perform professionally in such a way that other team members are supported. This is a quality of maturity that makes him stand out as a valued operative.",
          "3": "Regarding Avishek’s coding skills, we can say much in praise. Frankly, a modern Fintech system is not a project for a novice. The systems are many and various, from social media support to accounting, tracking, productivity and payment systems… The list of complexity dimensions is pretty long. Avishek is at home with any difficult project we throw at him."
        }
      },
      "tu": {
        "name": "Tribhuvan University",
        "company": "Central Department of Population Studies",
        "address": "Kirtipur, Kathmandu, Nepal",
        "description": {
          "0": "Avishek and the team developed a comprehensive website for 6th Asian Population Conference. The project was executed with exceptional skill, professionalism, and attention to detail, and we are confident in recommending their services for any future web development projects.",
          "1": "The website developed for the conference included the following key features:",
          "2": "1. Conference Information Hub: The website served as a central platform for all conference-related information, including schedules, themes, presentation-guidelines, venue information, and other essential updates. The design was user-friendly, visually appealing, and optimized for seamless navigation.",
          "3": "2. Registration and Payment System: A fully functional registration and payment system was integrated into the website, allowing participants to register for the conference and securely pay the conference fee online. The system was designed to handle multiple payment methods and ensured a smooth user experience.",
          "4": "3. Dedicated Admin Panel: A custom-built admin panel was developed to allow the conference organizers to manage all aspects of the event. This included updating conference details, managing participant registrations, and monitoring payment statuses. The admin panel was intuitive and efficient, significantly simplifying the management process.",
          "5": "Throughout the project, Avishek demonstrated excellent technical expertise, problem-solving skills, and a commitment to delivering high-quality results. They were responsive to feedback, met all deadlines, and ensured the website was fully functional and bug-free before launch.",
          "6": "The success of the conference website was instrumental in enhancing the overall experience for participants and organizers alike. I highly recommended Avishek for any web development projects and am confident they will bring the same level of dedication and expertise to future endeavors."
        }
      },
      "izzy": {
        "name": "Izzy Turner",
        "address": "Devon, UK",
        "description": {
          "0": "Avishek has created a clear, dynamic and stylish website that showcases my portfolio of artwork. The colour scheme, font and layout is in-keeping with my art and consistent throughout the website.",
          "1": "Navigation around the site is clear and easy for users. It displays and functions well on both phone and computer.",
          "2": "Avishek's communication throughout the commission was excellent and he met the deadline I set."
        }
      }
    },
    "workshops": {
      "title": "Certifications and Workshops",
      "datacamp-ai-data-science": {
        "title": "AI Engineer for Data Science Associate",
        "location": "DataCamp, Online",
        "description": "A comprehensive course covering deep learning, computer vision, natural language processing with Llama 3, explainable AI, MLOps concepts and software engineering principles. Certification exam required reviewing of a real-world business problem, exploratory data analysis, data validation and preparation for the model, build a neural network model, model implementation and calculate metrics for the model evaluation.",
        "date": "Jul 2025"
      },
      "future-leader": {
        "title": "Future Leader Experience Workshop",
        "location": "UWE Frenchay Campus, Bristol",
        "description": "A 3-days Leadership Experience Programme with Common Purpose, exposing real-world leadership. The programme featured insightful conversations with industry leaders, a site visit to SPARKS Bristol to explore how they manage ongoing challenges and maintain productivity, and a collaborative team effort bringing fresh perspectives and practical insights to tackle a real-world issue—homelessness—faced by Bristol Council.",
        "date": "Jun 2025"
      },
      "data-analysis": {
        "title": "Data Sharing and Analysis Workshop",
        "location": "Imperial College London, Silwood Park",
        "description": "A 3-days workshop in R programming, including data wrangling and visualisation, linear & non-linear models, time series (Linear modeling & distributions) and geospatial modeling along with tick drag activity for data sampling. Finished with a group project and presentation of predicting the incidence of Lyme disease in the UK, combining climatic data, using R and visualising the results in geospatial maps.",
        "date": "Jun 2025"  
      }
    },
    "previous-commissions": {
      "title": "Previous Commissions"
    }
  },
  "portfolio": {
    "title": "Portfolio",
    "order": "Ready to order your project?",
    "work-together": "Let's work together!",
    "features": {
      "time-tracking-system": "Time Tracking System",
      "payroll-system": "Payroll System",
      "online-payment-system": "Online Payment System",
      "beautiful-user-interface": "Beautiful User Interface",
      "user-management": "User Management with Roles",
      "smooth-user-experience": "Smooth User Experience",
      "seamless-interactions": "Seamless Interactions",
      "data-visualisation": "Data Visualisation with Charts",
      "cms": "Content Management System",
      "crm": "Client Relationship Management",
      "advanced-reporting": "Advanced Reporting",
      "chat-microservice": "Chat Microservice",
      "chat": "Real-time Chat",
      "cloud-storage": "Cloud Storage",
      "lms": "Learning Management System",
      "gen-ai-integration": "Generative AI Integration"
    },
    "projects": {
      "asian-population-association": {
        "title": "APA 6th Conference",
        "client": "Central Department of Population Studies, Tribhuvan University",
        "client-abbr": "CDPS, Tribhuvan University",
        "location": "Kirtipur, Kathmandu, Nepal",
        "duration": "2024",
        "description": {
          "0": "Managing this project from start to completion was a great privilege. We adopted agile development methodology to improve efficiency and ensure timely delivery. Additionally, I handled the server side logic, including database management, API development and testing, Slack integration for logging, payment gateway integration, and website deployment.",
          "1": "This website provides all the information about the conference including the themes, schedule, committee members and venue, along with clean and organised content management system.",
          "2": "Our platform offers seamless user registration with user-friendly interface and efficient administration. Users can easily register for the event and pay online to complete their registration. The administrators can update the website contents, verify documents and keep the participants up-to-date about the event via email. Moreover, automated emails are scheduled every three days to remind the participants to upload documents (if required and not provided yet) and complete their payments (if due)."
        },
        "status": "Completed"
      },
      "workzone": {
        "title": "Workzone1",
        "client": "Jeff Rogers",
        "location": "South Korea",
        "duration": "2023-2025",
        "description": {
          "0": "Working as a frontend-heavy full stack developer in Workzone1 has taken me to a different level of web development. Ensuring a seamless user experience, I handled most of the frontend design, along with some backend logics - CRUD with GraphQL and Laravel, OAuth authentication in Express JS and Mediasoup integration.",
          "1": "Workzone1 provides everything you need to manage your workforce including time tracking system with mouse clicks, keystrokes and screenshots, working patterns overview, payroll system - customizable system-generated invoice and payments via the system, accounts - where you can manage your company finances and your employees can manage theirs, your own cloud storage, real time chat microservice and localisation to make you feel at home.",
          "2": ""
        },
        "status": "Completed"
      },
      "global-english-campus": {
        "title": "Global English Campus",
        "client": "Jeff Rogers",
        "location": "South Korea",
        "duration": "2022-2025",
        "description": {
          "0": "Working as a frontend-heavy full stack developer in Global English Campus (GEC) has taken me to a different level of web development. Ensuring a seamless user experience, I handled most of the frontend design, along with some backend logics - CRUD with GraphQL and Laravel, OAuth authentication in Express JS and Mediasoup integration.",
          "1": "GEC is an online AI based learning system to quickly identify what students can and cannot do. It has adaptive and sequential learning strategies to constantly assess and assist students towards a higher level of English Skills, but with fun interactive online lesson and problem formats.",
          "2": ""
        },
        "status": "Completed"
      }
    }
  },
  "history": {
    "education": {
      "title": "Education",
      "msc-ai": {
        "title": "MSc Artificial Intelligence",
        "university": "UWE Bristol",
        "duration": "2024 - 2025",
        "description-1": "Started with foundational studies in search and optimisation, statistical inference, and core machine learning algorithms, progressively advancing into cutting-edge domains including deep learning, computer vision, natural language processing, big data analytics, knowledge-based and hybrid systems, and advanced statistical methods.",
        "description-2": "Developed skills in programming languages and machine learning frameworks, including Python, R, PyTorch, TensorFlow, and Scikit-Learn. Gained hands-on experience in data analysis, model development, and fine-tuning through practical projects and assignments, along with reproducible and ethical AI practices.",
        "description-3": "Finishing with a dissertation group project of 'LLM-Enhanced Interpretability of Explainable AI (XAI) for Dermatological Cancer Classification', building a Convolutional Neural Network (CNN) model to classify skin cancer images on diverse skin tones, and integrating Large Language Models (LLMs) to enhance the interpretability of the model's predictions."
      },
      "pg": {
        "title": "PG Diploma in Computer Application",
        "institution": "Kantipur City College",
        "university": "Purbanchal University",
        "duration": "2022",
        "description-1": "Built a solid theoretical and practical foundation in software development, gaining proficiency in programming languages, including C, C++, JavaScript, and PHP. Acquired hands-on experience with database management systems, digital systems, data structure and algorithms, computer networking, and data communication protocols. Developed a strong command of key mathematical concepts including discrete mathematics, linear algebra, calculus, probability, and statistics, building analytical and problem-solving capabilities.",
        "description-2": "Collaborated on a capstone group project to develop an 'Incident Reporting System' using C and MySQL. The team created a console-based executable application designed to systematically log and manage incident reports. Key features included user authentication and authorisation, dynamic incident logging, and the ability to filter reports based on multiple criteria to enhance data retrieval and usability."
      },
      "dsa": {
        "title": "Algorithm and Data Structures",
        "institution": "Free Code Camp",
        "duration": "2020",
        "description-1": "Acquired a solid foundation in JavaScript by mastering fundamental programming concepts. Progressed from basic data structures and control flow to advanced paradigms such as Object-Oriented Programming (OOP) and Functional Programming.",
        "description-2": "Gained hands-on experience with algorithmic problem-solving, browser local storage, and integrating third-party APIs to build dynamic, interactive web applications."
      },
      "bbs": {
        "title": "Bachelors in Business Studies",
        "institution": "Nepal Kasthamandap College",
        "university": "Tribhuvan University",
        "duration": "2015 - 2019",
        "description-1": "Developed a comprehensive foundation in business and management by exploring a wide range of topics, including mathematics, statistics, accounting, human resource management, economics, finance, and entrepreneurship. Built strong conceptual understanding and practical knowledge across business, financial systems, and administrative functions, forming a holistic perspective on organizational strategy and operations",
        "description-2": "Completed an individual capstone project focused on profit analysis of a local bank. Conducted in-depth research and examined five years of the bank's annual reports to evaluate financial trends, performance drivers, and areas for strategic improvement. Delivered a comprehensive report demonstrating proficiency in financial analysis and research methodology."
      },
      "swift": {
        "title": "SWIFT Computer Course",
        "institution": "NIIT",
        "university": "India",
        "duration": "2014",
        "description-1": "Gained a well-rounded understanding of essential computer skills, including proficiency in Microsoft Office Suite, foundational knowledge of graphic design principles, and an introduction to core web development concepts. Built practical capabilities in digital productivity, visual communication, and website structure and design.",
        "description-2": "Acquired practical skills and technical knowledge through a combination of theoretical instruction and hands-on exercises, enabling proficient application of these technologies across diverse professional contexts."
      }
    },
    "work": {
      "title": "Work History",
      "grw": {
        "title": "Grass Roots Web (GRW)",
        "position": "Head of Training, Voluntary",
        "duration": "2024 - 2025",
        "description-1": "Directed a global team of volunteers to deliver high-impact websites for charities and small businesses. Oversaw daily operations, coordinated cross-functional efforts, and ensured timely execution of all initiatives—driving digital empowerment for mission-driven organisations.",
        "description-2": "Designed and implemented innovative initiatives to elevate the volunteer experience, fostering stronger engagement and satisfaction. Proactively identified areas for operational improvement and introduced strategic solutions that significantly enhanced team productivity and workflow efficiency."
      },
      "apa": {
        "title": "Tribhuvan Universtity",
        "position": "Project Manager & Senior Backend Developer",
        "duration": "2024",
        "description-1": "Managed a one-time web development project for the 6th annual conference of Asian Population Association at Tribhuvan University, Nepal.",
        "description-2": "Interacted with client actively to understand their requirements, developed software requirement specification (SRS) and transformed them into clear action plans for my agile team. Conducted daily stand-up meetings to ensure project transparency, optimal productivity and timely delivery.",
        "description-3": "Furthermore, I provided continuous guidance to the front-end design and development along with handling the server-side logic, developing APIs, designing database structure and writing test cases."
      },
      "gec": {
        "title": "Global English Campus (GEC)",
        "position": "Fullstack Web Developer",
        "duration": "2022 - 2025",
        "description-1": "Working as a front-end and back-end developer to improve and enhance the performance of their website along with bringing new features. Working as a part of a group and carrying out various tasks with good mutual understanding and cooperation between the team members."
      },
      "autonomous": {
        "title": "Autonomous Technology",
        "position": "Fullstack Web Developer",
        "duration": "2021 - 2022",
        "description-1": "Carried out and managed all the projects of the clients along with the company's own website and CRM (Customer Relationship Management) web application."
      },
      "covid": {
        "title": "COVID-19 LOCKDOWN",
        "position": "Participated in online courses",
        "duration": "2020"
      },
      "ics": {
        "title": "ICS Raleigh",
        "position": "Volunteer",
        "duration": "June 2019 - September 2019",
        "description-1": "Worked as part of a team of fifteen in a community in Gorkha, Nepal to encourage sustainable development through raising awareness about various social issues and building polytunnels to promote off-season farming."
      },
      "freelance": {
        "title": "Freelance",
        "position": "Graphics Designer & Web Developer",
        "duration": "2017 - 2018",
        "description-1": "Designed logo, brochures, menu designs, web banners along with web templates and front-end development for various companies."
      },
      "dbros": {
        "title": "DBROS Technology",
        "position": "Graphics Designer & Junior Web Developer",
        "duration": "2015 - 2016",
        "description-1": "Created various designs, for the company as well as its clients, which consists of web template designs, GIF advertisements, banners and so on. Moreover worked as a junior web developer side by side with experts in web development."
      }
    }
  },
  "contact": {
    "title": "Contact Information",
    "get-in-touch": "Get in touch"
  }
}
