{
  "actions": {
    "explore-now": "EXPLORE NOW",
    "enquire-more": "Enquire more",
    "read-more": "Read more",
    "recommendation": "Recommendation",
    "certificate": "Certificate",
    "send-message": "SEND MESSAGE",
    "contact-me": "CONTACT ME",
    "view-on-google-map": "View on Google Map",
    "view-latest-project": "View Latest Project"
  },
  "profile": {
    "name": "Avishek Dangol",
    "position": "Machine Learning Engineer {'|'} Full Stack Web Developer",
    "country": "United Kingdom",
    "city": "London",
    "download-cv": "Download CV"
  },
  "labels": {
    "residence": "Residence:",
    "city": "City:",
    "country": "Country:",
    "description": "Description",
    "project-details": "Project Details",
    "status": "Status:",
    "client": "Client:",
    "organisation": "Organisation:",
    "location": "Location:",
    "associated-networks": "Associated Networks",
    "features": "Features",
    "skills-and-deliverables": "Skills and Deliverables"
  },
  "languages": {
    "nepali": "Nepali",
    "english": "English",
    "hindi": "Hindi"
  },
  "skills": {
    "ml": {
      "title": "Machine Learning",
      "data-exploration": "Data Exploration",
      "computer-vision": "Computer Vision",
      "natural-language-processing": "Natural Language Processing",
      "vector-databases": "Vector Databases",
      "semantic-search": "Semantic Search",
      "explainable-ai": "Explainable AI"
    },
    "stats": {
      "title": "Statistics",
      "r-script": "R Scripts",
      "bootstrapping": "Bootstrapping",
      "time-series-analysis": "Time Series Analysis",
      "geospatial-analysis": "Geospatial Analysis"
    },
    "laravel": {
      "title": "Laravel",
      "multi-tenancy": "Multi-Tenancy",
      "websockets": "Web Sockets",
      "rest-api": "REST API",
      "testing": "Testing"
    },
    "vue": {
      "title": "Vue JS",
      "vue-cli": "Vue CLI",
      "vuex": "State Management with Vuex",
      "pinia": "State Management with Pinia"
    },
    "react": {
      "title": "React JS",
      "context-api": "Context API",
      "hoc": "Higher Order Components",
      "state-management": "State Management with Redux"
    },
    "node": {
      "title": "Node JS",
      "express": "Express JS",
      "rest-api": "REST API",
      "middlewares": "Middlewares",
      "websockets": "Web Sockets"
    }
  },
  "knowledge": {
    "ml": "PyTorch, Tensorflow, Scikit-Learn",
    "shadcn-ant": "Shadcn, Ant Design, Material UI",
    "sql": "MYSQL, PostgreSQL, MongoDB",
    "css": "Bootstrap CSS, Tailwind CSS",
    "git": "Git, GitHub, GitLab, BitBucket"
  },
  "counter": {
    "years-experience": "Years Experience",
    "previous-commissions": "Previous Commissions",
    "happy-customers": "Happy Customers"
  },
  "home": {
    "banner": {
      "title": "Join me in this Amazing Journey!",
      "i": "I",
      "develop-models": "develop machine learning models.",
      "develop-websites": "develop websites.",
      "design-graphics": "design graphics."
    },
    "services": {
      "title": "What I do",
      "web-apps": {
        "title": "Web Development",
        "description": {
          "0": "I build modern web applications that streamline operations, elevate customer engagement, and accelerate growth. By integrating web development with AI and agentic systems, I deliver smart, adaptive solutions that help businesses stay ahead in a fast-moving digital landscape."
        }
      },
      "machine-learning": {
        "title": "Machine Learning",
        "description": {
          "0": "I design intelligent systems that automate tasks, enhance decision-making, and deliver personalised experiences. From predictive analytics and computer vision to natural language processing, I help businesses harness the power of AI to drive innovation and efficiency, and real-world impact."
        }
      }
    },
    "networks": {
      "title": "My Networks",
      "sd": {
        "name": "Sanjok Dangol",
        "job": "Project Manager"
      },
      "sm": {
        "name": "Sujip Maharjan",
        "job": "System Architect"
      },
      "kk": {
        "name": "Kumud Khatiwada",
        "job": "MERN Stack Developer"
      },
      "pp": {
        "name": "Pawan Pulami",
        "job": "Django Developer"
      }
    },
    "recommendations": {
      "title": "Recommendations",
      "jeff": {
        "name": "Jeff Rogers",
        "position": "CEO / CTO",
        "company": "Global English Campus",
        "address": "South Korea",
        "description": {
          "0": "I am very pleased to speak positively about the experience we have had with Avishek during the entire tenure of his time with us.",
          "1": "Two of the main strengths that Avishek has is his positive attitude and his superior communication skills, which are critical in development when abstract and sometimes unclear concepts are being converted to code. Avishek always clarifies through inquiry, by which process all members of the team benefit, as does the project as a whole.",
          "2": "Another quality that we value highly in Avishek, is his ability to work on a diverse team, and to not only do his part, but to perform professionally in such a way that other team members are supported. This is a quality of maturity that makes him stand out as a valued operative.",
          "3": "Regarding Avishek’s coding skills, we can say much in praise. Frankly, a modern Fintech system is not a project for a novice. The systems are many and various, from social media support to accounting, tracking, productivity and payment systems… The list of complexity dimensions is pretty long. Avishek is at home with any difficult project we throw at him."
        }
      },
      "tu": {
        "name": "Tribhuvan University",
        "company": "Central Department of Population Studies",
        "address": "Kirtipur, Kathmandu, Nepal",
        "description": {
          "0": "Avishek and the team developed a comprehensive website for 6th Asian Population Conference. The project was executed with exceptional skill, professionalism, and attention to detail, and we are confident in recommending their services for any future web development projects.",
          "1": "The website developed for the conference included the following key features:",
          "2": "1. Conference Information Hub: The website served as a central platform for all conference-related information, including schedules, themes, presentation-guidelines, venue information, and other essential updates. The design was user-friendly, visually appealing, and optimized for seamless navigation.",
          "3": "2. Registration and Payment System: A fully functional registration and payment system was integrated into the website, allowing participants to register for the conference and securely pay the conference fee online. The system was designed to handle multiple payment methods and ensured a smooth user experience.",
          "4": "3. Dedicated Admin Panel: A custom-built admin panel was developed to allow the conference organizers to manage all aspects of the event. This included updating conference details, managing participant registrations, and monitoring payment statuses. The admin panel was intuitive and efficient, significantly simplifying the management process.",
          "5": "Throughout the project, Avishek demonstrated excellent technical expertise, problem-solving skills, and a commitment to delivering high-quality results. They were responsive to feedback, met all deadlines, and ensured the website was fully functional and bug-free before launch.",
          "6": "The success of the conference website was instrumental in enhancing the overall experience for participants and organizers alike. I highly recommended Avishek for any web development projects and am confident they will bring the same level of dedication and expertise to future endeavors."
        }
      },
      "izzy": {
        "name": "Izzy Turner",
        "address": "Devon, UK",
        "description": {
          "0": "Avishek has created a clear, dynamic and stylish website that showcases my portfolio of artwork. The colour scheme, font and layout is in-keeping with my art and consistent throughout the website.",
          "1": "Navigation around the site is clear and easy for users. It displays and functions well on both phone and computer.",
          "2": "Avishek's communication throughout the commission was excellent and he met the deadline I set."
        }
      }
    },
    "workshops": {
      "datacamp-ai-developer": {
        "title": "AI Engineer for Developers Associate",
        "location": "DataCamp, Online",
        "description": "A comprehensive course covering deep learning, computer vision, natural language processing with Llama 3, explainable AI, MLOps concepts and software engineering principles. Certification exam required reviewing of a real-world business problem, exploratory data analysis, data validation and preparation for the model, build a neural network model, model implementation and calculate metrics for the model evaluation.",
        "date": "Jul 2025"
      },
      "title": "Certifications and Workshops",
      "datacamp-ai-data-science": {
        "title": "AI Engineer for Data Science Associate",
        "location": "DataCamp, Online",
        "description": "A comprehensive course covering deep learning, computer vision, natural language processing with Llama 3, explainable AI, MLOps concepts and software engineering principles. Certification exam required reviewing of a real-world business problem, exploratory data analysis, data validation and preparation for the model, build a neural network model, model implementation and calculate metrics for the model evaluation.",
        "date": "Jul 2025"
      },
      "future-leader": {
        "title": "Future Leader Experience Workshop",
        "location": "UWE Frenchay Campus, Bristol",
        "description": "A 3-days Leadership Experience Programme with Common Purpose, exposing real-world leadership. The programme featured insightful conversations with industry leaders, a site visit to SPARKS Bristol to explore how they manage ongoing challenges and maintain productivity, and a collaborative team effort bringing fresh perspectives and practical insights to tackle a real-world issue—homelessness—faced by Bristol Council.",
        "date": "Jun 2025"
      },
      "data-analysis": {
        "title": "Data Sharing and Analysis Workshop",
        "location": "Imperial College London, Silwood Park",
        "description": "A 3-days workshop in R programming, including data wrangling and visualisation, linear & non-linear models, time series (Linear modeling & distributions) and geospatial modeling along with tick drag activity for data sampling. Finished with a group project and presentation of predicting the incidence of Lyme disease in the UK, combining climatic data, using R and visualising the results in geospatial maps.",
        "date": "Jun 2025"  
      },
      "dsa": {
        "title": "Algorithm and Data Structures",
        "location": "Free Code Camp, Online",
        "date": "Aug 2020",
        "description": "Acquired a solid foundation in JavaScript by mastering fundamental programming concepts. Progressed from basic data structures and control flow to advanced paradigms such as Object-Oriented Programming (OOP) and Functional Programming. Gained hands-on experience with algorithmic problem-solving, browser local storage, and integrating third-party APIs to build dynamic, interactive web applications."
      }
    },
    "previous-commissions": {
      "title": "Previous Commissions"
    }
  },
  "portfolio": {
    "title": "Portfolio",
    "order": "Got a challenge? I've got solutions.",
    "work-together": "Let's work together!",
    "features": {
      "time-tracking-system": "Time Tracking System",
      "payroll-system": "Payroll System",
      "online-payment-system": "Online Payment System",
      "beautiful-user-interface": "Beautiful User Interface",
      "user-management": "User Management with Roles",
      "smooth-user-experience": "Smooth User Experience",
      "seamless-interactions": "Seamless Interactions",
      "data-visualisation": "Data Visualisation with Charts",
      "cms": "Content Management System",
      "crm": "Client Relationship Management",
      "advanced-reporting": "Advanced Reporting",
      "chat-microservice": "Chat Microservice",
      "chat": "Real-time Chat",
      "cloud-storage": "Cloud Storage",
      "lms": "Learning Management System",
      "gen-ai-integration": "Generative AI Integration",
      "automated-ai-workflows": "Automated AI Workflows",
      "http-support": "HTTP Support",
      "llm-support": "Large Language Models (LLMs) Support",
      "graph-database": "Graph Database",
      "resnet34-backbone-cnn": "ResNet34 Backbone CNN",
      "lora": "Low Rank Adaptation (LoRA)",
      "grad-cam": "GradCAM Visualisation",
      "shap": "SHAP Visualisation",
      "influence-functions": "Influence Functions",
      "llm-interpretation": "LLM Interpretation",
      "attention-mechanism": "Attention Mechanism"
    },
    "projects": {
      "skin-cancer-detection": {
        "title": "Skin Cancer Detection using CNN and Explainable AI",
        "duration": "2025",
        "position": "MSc. AI Group Project",
        "client": "UWE Bristol",
        "location": "Bristol",
        "description": {
          "0": "Collaborating on this research project was an invaluable learning experience. I gained practical expertise in designing and training convolutional neural networks (CNNs), while integrating attention mechanisms and Low-Rank Adaptation (LoRA) to boost model performance and generalisation. To enhance interpretability, we implemented three complementary Explainable AI techniques—GradCAM, SHAP, and Influence Functions—each offering distinct insights into model behaviour. We then passed these outputs to a Large Language Model (LLM), enabling natural language explanations tailored for non-technical stakeholders.",
          "1": "The journey from an initial accuracy of barely 70% to surpassing 90% through iterative experimentation with architectures and optimisation strategies was technically demanding yet deeply rewarding. We used weights&biases to keep track of these experiments and produce visualisations. Throughout the project, we adhered to ethical AI principles, prioritising data privacy, fairness, and transparency at every stage of model development and deployment. To support equitable outcomes, we utilised a publicly available dataset featuring diverse skin tones and applied stratified sampling techniques to preserve class distribution across diverse skin tone variations and diagnostic labels. This approach ensured that our model remained both performant and inclusive, aligning technical innovation with responsible AI practice.",
          "2": "We developed two modular Python packages—one dedicated to model inference and the other to explainability. These were seamlessly integrated within a Dockerised environment, enabling streamlined deployment and intuitive user interaction through a unified interface."
        },
        "status": "Completed"
      },
      "asian-population-association": {
        "title": "APA 6th Conference",
        "position": "Project Manager & Senior Backend Developer",
        "client": "Central Department of Population Studies, Tribhuvan University",
        "client-abbr": "CDPS, Tribhuvan University",
        "location": "Kirtipur, Kathmandu, Nepal",
        "duration": "2024",
        "description": {
          "0": "Managing this project from start to completion was a great privilege. We adopted agile development methodology to improve efficiency and ensure timely delivery. Additionally, I handled the server side logic, including database management, API development and testing, Slack integration for logging, payment gateway integration, and website deployment.",
          "1": "This website provides all the information about the conference including the themes, schedule, committee members and venue, along with clean and organised content management system.",
          "2": "Our platform offers seamless user registration with user-friendly interface and efficient administration. Users can easily register for the event and pay online to complete their registration. The administrators can update the website contents, verify documents and keep the participants up-to-date about the event via email. Moreover, automated emails are scheduled every three days to remind the participants to upload documents (if required and not provided yet) and complete their payments (if due)."
        },
        "status": "Completed"
      },
      "workzone": {
        "title": "Workzone1",
        "position": "Frontend-focused Full Stack Developer",
        "client": "Jeff Rogers",
        "location": "South Korea",
        "duration": "2023-2025",
        "description": {
          "0": "Working as a frontend-heavy full stack developer in Workzone1 has taken me to a different level of web development. Ensuring a seamless user experience, I handled most of the frontend design, along with some backend logics - CRUD with GraphQL and Laravel, OAuth authentication in Express JS and Mediasoup integration.",
          "1": "Workzone1 provides everything you need to manage your workforce including time tracking system with mouse clicks, keystrokes and screenshots, working patterns overview, payroll system - customizable system-generated invoice and payments via the system, accounts - where you can manage your company finances and your employees can manage theirs, your own cloud storage, real time chat microservice and localisation to make you feel at home.",
          "2": ""
        },
        "status": "Completed"
      },
      "global-english-campus": {
        "title": "Global English Campus",
        "position": "Frontend-focused Full Stack Developer",
        "client": "Jeff Rogers",
        "location": "South Korea",
        "duration": "2022-2025",
        "description": {
          "0": "Working as a frontend-focused full stack developer at Global English Campus (GEC) marked my first experience contributing to a large-scale project. I was responsible for implementing a range of features across both the frontend and backend, which provided valuable exposure to scalable architecture and collaborative development workflows. During this time, I developed a strong foundation in best coding practices, including modular design, clean code principles, and effective version control.",
          "1": "GEC is an online AI based learning system to quickly identify what students can and cannot do. It has adaptive and sequential learning strategies to constantly assess and assist students towards a higher level of English Skills, but with fun interactive online lesson and problem formats.",
          "2": ""
        },
        "status": "Completed"
      },
      "datablock-ai": {
        "title": "Datablock AI",
        "position": "Full Stack Developer",
        "client": "Jeff Rogers",
        "location": "South Korea",
        "duration": "2024-2025",
        "description": {
          "0": "I had an opportunity to work on Datablock AI, building my experience in Django REST framework and graph database - Neo4j. I handled the frontend design and development, along with backend logics - CRUD with Django, serialisation and graph database management.",
          "1": "DatablockAI is a web application designed to streamline the process of building and managing AI workflows. It allows users to perform HTTP requests, make generative AI calls with different Large Language Models (LLMs), access and manage their own databases, run workflows conditionally, and share workflows.",
          "2": "The application features an interactive chat interface for testing AI workflows, a response explorer for viewing and managing AI responses, and a detailed view of individual responses. It also includes functionality for updating nodes within workflows, ensuring that users can easily modify their AI processes as needed."
        },
        "status": "Completed"
      }
    }
  },
  "history": {
    "education": {
      "title": "Education",
      "msc-ai": {
        "title": "MSc Artificial Intelligence",
        "university": "UWE Bristol",
        "duration": "2024 - 2025",
        "description-1": "Started with foundational studies in search and optimisation, statistical inference, and core machine learning algorithms, progressively advancing into cutting-edge domains including deep learning, computer vision, natural language processing, big data analytics, knowledge-based and hybrid systems, and advanced statistical methods.",
        "description-2": "Developed skills in programming languages and machine learning frameworks, including Python, R, PyTorch, TensorFlow, and Scikit-Learn. Gained hands-on experience in data analysis, model development, and fine-tuning through practical projects and assignments, along with reproducible and ethical AI practices.",
        "description-3": "Finishing with a dissertation group project of 'LLM-Enhanced Interpretability of Explainable AI (XAI) for Dermatological Cancer Classification', building a Convolutional Neural Network (CNN) model to classify skin cancer images on diverse skin tones, and integrating Large Language Models (LLMs) to enhance the interpretability of the model's predictions."
      },
      "pg": {
        "title": "PG Diploma in Computer Application",
        "institution": "Kantipur City College",
        "university": "Purbanchal University",
        "duration": "2022",
        "description-1": "Built a solid theoretical and practical foundation in software development, gaining proficiency in programming languages, including C, C++, JavaScript, and PHP. Acquired hands-on experience with database management systems, digital systems, data structure and algorithms, computer networking, and data communication protocols. Developed a strong command of key mathematical concepts including discrete mathematics, linear algebra, calculus, probability, and statistics, building analytical and problem-solving capabilities.",
        "description-2": "Collaborated on a capstone group project to develop an 'Incident Reporting System' using C and MySQL. The team created a console-based executable application designed to systematically log and manage incident reports. Key features included user authentication and authorisation, dynamic incident logging, and the ability to filter reports based on multiple criteria to enhance data retrieval and usability."
      },
      "bbs": {
        "title": "Bachelors in Business Studies",
        "institution": "Nepal Kasthamandap College",
        "university": "Tribhuvan University",
        "duration": "2015 - 2019",
        "description-1": "Developed a comprehensive foundation in business and management by exploring a wide range of topics, including mathematics, statistics, accounting, human resource management, economics, finance, and entrepreneurship. Built strong conceptual understanding and practical knowledge across business, financial systems, and administrative functions, forming a holistic perspective on organizational strategy and operations",
        "description-2": "Completed an individual capstone project focused on profit analysis of a local bank. Conducted in-depth research and examined five years of the bank's annual reports to evaluate financial trends, performance drivers, and areas for strategic improvement. Delivered a comprehensive report demonstrating proficiency in financial analysis and research methodology."
      },
      "swift": {
        "title": "SWIFT Computer Course",
        "institution": "NIIT",
        "university": "India",
        "duration": "2014",
        "description-1": "Gained a well-rounded understanding of essential computer skills, including proficiency in Microsoft Office Suite, foundational knowledge of graphic design principles, and an introduction to core web development concepts. Built practical capabilities in digital productivity, visual communication, and website structure and design.",
        "description-2": "Acquired practical skills and technical knowledge through a combination of theoretical instruction and hands-on exercises, enabling proficient application of these technologies across diverse professional contexts."
      }
    },
    "work": {
      "title": "Work History",
      "grw": {
        "title": "Grass Roots Web (GRW)",
        "position": "Head of Operations, Voluntary",
        "duration": "2024 - 2025",
        "description-1": "Directed a global team of volunteers to deliver high-impact websites for charities and small businesses. Oversaw daily operations, coordinated cross-functional efforts, and ensured timely execution of all initiatives. Took responsibility to onboard new volunteers and ensure their smooth journey with GrassRootsWeb.",
        "description-2": "Designed and implemented innovative strategies to elevate the volunteer experience, fostering stronger engagement and satisfaction. Proactively identified areas for operational improvement and introduced solutions that significantly enhanced team productivity and workflow efficiency."
      },
      "apa": {
        "title": "Tribhuvan Universtity",
        "position": "Project Manager & Senior Backend Developer",
        "duration": "2024",
        "description-1": "Managed a one-time web development project for the 6th annual conference of Asian Population Association at Tribhuvan University, Nepal.",
        "description-2": "Actively interacted with clients to understand their requirements, developed software requirement specification (SRS) and transformed them into clear action plans for my agile team. Conducted daily stand-up meetings to ensure project transparency, optimal productivity and timely delivery.",
        "description-3": "Furthermore, I provided continuous guidance to the front-end design and development team along with handling the server-side logic, developing APIs, designing database structure and writing test cases."
      },
      "gec": {
        "title": "Global English Campus (GEC)",
        "position": "Full-stack Web Developer",
        "duration": "2022 - 2025",
        "description-1": "Worked as a full-stack developer across diverse projects, delivering new features, resolving complex bugs, and refactoring legacy code to align with industry best practices. Collaborated within cross-functional teams, demonstrating strong communication and mutual respect to ensure smooth execution of tasks..",
        "description-2": "Contributed to three distinct projects: an AI-enhanced online learning platform (Global English Campus), a collaborative work management system with integrated chat microservices (Workzone1), and a node-based AI development environment for automated workflows (Datablock AI)."
      },
      "autonomous": {
        "title": "Autonomous Technology",
        "position": "Full-stack Web Developer",
        "duration": "2021 - 2022",
        "description-1": "Led the development and management of all client projects, alongside the company's internal website and custom CRM web application. Ensured consistent delivery of high-quality solutions by balancing external requirements with in-house platform optimisation, contributing to both client satisfaction and operational efficiency."
      },
      "covid": {
        "title": "COVID-19 LOCKDOWN",
        "position": "Started my programming journey",
        "duration": "2020"
      },
      "ics": {
        "title": "ICS Raleigh",
        "position": "Volunteer",
        "duration": "June 2019 - September 2019",
        "description-1": "Worked as part of a team of fifteen in Gorkha, Nepal to promote off-season farming and sustainable development. Contributed to community outreach initiatives to raise awareness around key social issues, and led construction of polytunnels to support year-round agricultural productivity and local resilience."
      },
      "freelance": {
        "title": "Freelance",
        "position": "Graphics Designer",
        "duration": "2017 - 2018",
        "description-1": "Designed a wide range of visual assets—including logos, brochures, menu layouts, web banners, and responsive web templates—for multiple companies across diverse industries. Delivered cohesive branding solutions that enhanced user engagement and aligned with each client's identity and strategic goals."
      },
      "dbros": {
        "title": "DBROS Technology",
        "position": "Graphics Designer",
        "duration": "2015 - 2016",
        "description-1": "Produced a diverse array of digital designs for both the company and its clients, including responsive web templates, animated GIF advertisements, and promotional banners."
      }
    }
  },
  "contact": {
    "title": "Contact Information",
    "get-in-touch": "Get in touch"
  }
}
